trade_exp/src/DataProcessors/КартографическийИнтерфейсДоставка/КартографическийИнтерфейсДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КартографическийИнтерфейсДоставка</name>
</mdclass:DataProcessor>

trade_exp/src/Enums/ВидыДоставокДоКлиента/ВидыДоставокДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДоставокДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cc6bd2-b207-434d-b027-c3ef416c447c">
    <name>Розничная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8cebbe69-bf66-4554-90d5-9fe9e46e6dbf">
    <name>СборнаяОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4da8f5b7-705c-495c-976b-5d4823a1f879">
    <name>Внутренняя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e3544ba3-ce9f-46e6-9877-fa2b4b9656af">
    <name>ДистрибуцияСборныеГрузы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ТарифыПеревозчиков/ТарифыПеревозчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="24c6a877-4f1c-4dbe-afb2-d94aadcead01">
  <name>ТарифыПеревозчиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="af0ac3df-db57-4183-8f2f-690eb51fb7d7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9485158f-d008-4268-945c-d6ccca95a414">
    <name>ДляСборнойОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="93b2577d-07a8-4182-a89b-a956fb1b33da">
    <name>ГрузоподъемностьВТоннах</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b60e2725-f2a3-4f1e-ba28-2760fa52f893">
    <name>ТарифПрофлистТруба</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="af3e0131-96c4-4efe-b0f1-3198439f97d1">
    <name>Экспресс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed070249-95fe-4a98-aab0-687b9c77e115">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0b074e78-b04d-4a01-8bd7-ae8bc98e9218">
    <name>ВидДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a66cdaaa-9ce3-4dff-94b1-7b398fd9911f">
    <name>СтоимостьЗаЧас</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7c245426-7e60-40e8-ba5d-8d7bcef069b7">
    <name>ТипДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="173d0c50-31b7-4740-bfa8-fcf2ecd4cb3e">
    <name>ВидАвтомобиля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1fb4fa03-6903-4f59-b1bd-43ee3147ba73">
    <name>ПоТарифуВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="534bf2b0-41b4-4620-8bea-39b957ce0fe4">
    <name>ТипТС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="82542f57-0260-41d9-a912-baa0edf17a05">
    <name>ЗонаДействияТарифа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5474e448-a36e-4ba0-a641-426f0e6e5d47">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c1c8ae76-4d22-4453-99ac-41a37bb16432">
    <name>МаксимальнаяДлинаГруза</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="f6b842ad-f897-4c64-9e40-32c5b9803fd6">
    <name>Интервалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6754cc9c-9c93-41ca-aa85-a8a9fa1e9531">
      <name>Интервал</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/ОбъектыДоставки/ОбъектыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8a524563-74ec-492a-ad57-be7d69cd00c2">
  <name>ОбъектыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <owners>Catalog.Склады</owners>
  <owners>Catalog.СтруктураПредприятия</owners>
  <attributes extendedConfigurationObject="b632079c-a491-4c8e-a728-90dacee78346">
    <name>ВозможностьПодъезда</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2668b2c7-b6ec-40d4-b565-489e4e610198">
    <name>ВремяРаботыБудниПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="88d72d78-5ca5-4de7-850c-770d258db261">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="28bba8b3-7f4d-41ff-9455-7e94462d858a">
    <name>ВремяРаботыБудниС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="da76be5e-62bc-49f1-a480-3baa840d8945">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56dae0a6-ed25-4a8f-8960-60080f0a83d8">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67a11e9d-fb21-4fbe-b1e9-25b19a4610c6">
    <name>ВремяОбедаС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ee7fac32-7ba7-4358-9411-5e0d6ee7dda0">
    <name>ВремяОбедаПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b86ed39b-61ff-4079-8183-bd1677526f23">
    <name>ВремяРаботыСубботаС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6f4ad0c2-296a-4c89-adc8-16799ecba27a">
    <name>ВремяРаботыСубботаПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea2edc56-a45e-4c53-9a85-6f3eff97fd59">
    <name>ВремяРаботыВоскресеньеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0cc15041-40ec-4318-9cfe-5710655d1cbd">
    <name>ВремяРаботыВоскресеньеПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bbecceea-1384-494e-9c85-a679c5fce7b1">
    <name>Выходные</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>67</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f9744db6-485c-438f-8d91-cf893d00a27f">
    <name>ТелефонНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="60ca7753-bbb8-431d-a875-aea1947fc08e">
    <name>ТипТорговойТочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59d76235-dd31-458d-9411-3d9b7a493afc">
    <name>ФорматТорговогоЗала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a986424d-0a3e-4740-aca8-895cd32b4426">
    <name>СпособПолученияТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4d73832a-12f5-4f0d-a4aa-c15f4f66a53c">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="85dd6c90-1e42-443a-b972-69f9e2f364d2">
    <name>ПлощадьТорговогоЗала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a0fba8eb-3c71-45fc-bd14-5b04ba97ac80">
    <name>ПлощадьСклада</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3a8443db-459d-4bf3-a25d-2cbc05e35069">
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18e4024d-4ba5-4991-a924-640fa009ae81">
    <name>ТипПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d32c2e6-e32c-48e0-b914-04ada48b2f00">
    <name>ЗонаДоставкиДляВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c339f18-9086-4fbc-985e-6417c85b5e4b">
    <name>Стенд</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8cda761-0307-4453-a140-4b158f1006f4">
    <name>Субдилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="947bed4f-bc19-4990-baef-be8e1867234b">
    <name>Маркетплейс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="80c5f1a6-5211-42f4-a726-b34e70d01865">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b75d8f95-105a-4f58-aa1b-259a534bca75">
    <name>СозданАвтоматически</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="c2408c15-215d-4387-95bd-b0084a6336b2">
    <name>Стенды</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2a2c4a5a-ed90-4dbd-8431-204a72194ec1">
      <name>Стенд</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="d86afa7e-20a5-4cb3-b378-2f0a999ca4dd">
    <name>Субдилеры</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f37527f6-53de-448e-8079-ce81f042232e">
      <name>Субдилер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/DataProcessors/КартографическийИнтерфейсДоставка/Forms/Карта/Module.bsl
#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОткрытИзДокумента= Ложь;
	Если Параметры.Свойство("ОткрытИзДокумента") Тогда
		ОткрытИзДокумента= Параметры.ОткрытИзДокумента;
	КонецЕсли;
	
	Если ОткрытИзДокумента Тогда
		Партнер= Параметры.Партнер;
		Филиал= Параметры.Филиал;
		ВидДоставки= Параметры.ВидДоставки;
		Элементы.Тариф.Видимость = НЕ Параметры.ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Розничная");
		Тариф= Параметры.Тариф;
		Адрес= Параметры.Адрес;
		Широта = Параметры.Широта;
		Долгота = Параметры.Долгота;
		ТарифВРучную=  Параметры.ТарифВРучную;  
		БезСтоимостиФилиалов = Ложь;
		Если Параметры.Свойство("БезСтоимостиФилиалов") Тогда  
			БезСтоимостиФилиалов = Параметры.БезСтоимостиФилиалов;	
		КонецЕсли;	

		Если ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда
			ВариантДоставки= "ОРК";
			НДС= "СНДС";
			ВидСтоимости= "СтоимостьДляВодителя";
		ИначеЕсли ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Внутренняя Тогда	
			ВариантДоставки= "Внутренняя";
			НДС= "СНДС";
			ВидСтоимости= "СтоимостьДляКлиента";
		Иначе   
			ВариантДоставки= "Розница";
			Если  ВидДоставки = Перечисления.ВидыДоставокДоКлиента.ДистрибуцияСборныеГрузы Тогда 	
				НДС = "СНДС"; 
				БезСтоимостиФилиалов = Истина;  
				ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная;
				
				Если РольДоступна("ПолныеПрава") Или РольДоступна("ОтделЛогистики") Тогда
					Элементы.ГруппаРазгрузки.Видимость = Истина;
				Иначе 
					Элементы.ГруппаРазгрузки.Видимость = Ложь;
				КонецЕсли;			
			Иначе
				НДС= "БезНДС"; 
			КонецЕсли;
			ВидСтоимости= "СтоимостьДляКлиента";  
		КонецЕсли;
		
		ПараметрыРазгрузкиАдресВХранилище = Параметры.ПараметрыРазгрузкиАдресВХранилище;
		ПараметрыРазгрузки = ПолучитьИзВременногоХранилища(ПараметрыРазгрузкиАдресВХранилище);
		
		Если ТипЗнч(ПараметрыРазгрузки) = Тип("Структура") Тогда 
			Этаж = ПараметрыРазгрузки.Этаж;
			НомерКвартиры = ПараметрыРазгрузки.НомерКвартиры;
			ВариантРазгрузки = ПараметрыРазгрузки.ВариантРазгрузки;
		КонецЕсли;
		
	Иначе
		Подразделение= Пользователи.ТекущийПользователь().Подразделение;
		Если ЗначениеЗаполнено(Подразделение.Родитель) Тогда
			Филиал= Подразделение.Родитель;
		Иначе
			Филиал= Подразделение;
		КонецЕсли;
		
		ВариантДоставки= "Розница";
		НДС= "БезНДС";
		ВидСтоимости= "СтоимостьДляКлиента";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		Тариф= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
		ТарифВРучную= Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Тариф) Тогда
		Тариф= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Если ЗначениеЗаполнено(Партнер) Тогда
			Адрес= АльтерраОбщегоНазначения.ПолучитьКонтактнуюИнформацию(Партнер, Справочники.ВидыКонтактнойИнформации.АдресПартнера);
		КонецЕсли
	КонецЕсли;

	//детали адреса
	Если ЗначениеЗаполнено(Адрес) Тогда
		НомерДома = Параметры.НомерДома;
		НомерКвартиры = Параметры.НомерКвартиры;
		ЧастныйДом = Параметры.ЭтоЧастныйДом;
		НомерКорпуса = Параметры.НомерКорпуса;
		НомерОфиса = Параметры.НомерОфиса;
		ДополнениеКАдресу = Параметры.ДополнениеКАдресу;
		
		НомерДомаКарта = ПолучитьДомИзАдреса();
		УстановитьДоступностьДома();
	КонецЕсли;

	Элементы.ФормаПередатьВДокумент.Видимость= ОткрытИзДокумента;
	Элементы.Тариф.ТолькоПросмотр= Не ТарифВРучную;
	
	Элементы.ГруппаРазгрузки.Доступность = РасчетРазгрузкиДействует(ТекущаяДата());
	
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	ИнициализироватьКарту();
	ОчиститьПараметрыРазгрузки();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ТарифНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ВариантДоставки = "Выписка/АктивДо1т" Тогда
		СтандартнаяОбработка= Ложь;

		ЗаполнитьданныеВыбора(ДанныеВыбора);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ТарифПриИзменении(Элемент)
	ИнициализироватьКарту();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьданныеВыбора(ДанныеВыбора)
	Тариф1= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
	ДанныеВыбора= Новый СписокЗначений;
	ДанныеВыбора.Добавить(Тариф);
КонецПроцедуры

&НаКлиенте
Процедура ВариантДоставкиПриИзменении(Элемент)
	ВариантДоставкиПриИзмененииНаСервере();
КонецПроцедуры
&НаСервере
Процедура ВариантДоставкиПриИзмененииНаСервере()
	Если ВариантДоставки = "Розница" Тогда
		ВидСтоимости= "СтоимостьДляКлиента";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "БезНДС";
	ИначеЕсли ВариантДоставки = "ОРК" Тогда
		ВидСтоимости= "СтоимостьДляВодителя";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "СНДС";
	ИначеЕсли ВариантДоставки = "Внутренняя" Тогда
		ВидСтоимости= "СтоимостьДляВодителя";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Внутренняя;
		НДС= "СНДС";
	ИначеЕсли ВариантДоставки = "Выписка/Актив" Тогда
		ВидСтоимости= "СтоимостьДляВодителя";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "БезНДС";
	ИначеЕсли ВариантДоставки = "Выписка/АктивДо1т" Тогда 
		ВидСтоимости= "СтоимостьДляКлиента";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "БезНДС";
	Иначе
		ВидСтоимости= "СтоимостьДляКлиента";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "БезНДС";
	КонецЕсли;
	
	ИнициализироватьКарту();
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ИнициализироватьКарту();
	ОчиститьПараметрыРазгрузки();
КонецПроцедуры

&НаКлиенте
Процедура ЧастныйДомПриИзменении(Элемент)
	НомерКвартиры = 0;
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура НомерДомаПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура НомерКвартирыПриИзменении(Элемент)
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриИзмененииСтрокиАдреса()
	
	НомерДома = ПолучитьДомИзАдреса();
	НомерДомаКарта = НомерДома;
	
	УстановитьВидимостьДоступность();
	Если ЧастныйДом Тогда
		НомерКвартиры = "";
	КонецЕсли;
	Если НомерДома="" Тогда
		НомерКвартиры="";
	КонецЕсли;
	ОчиститьПараметрыРазгрузки();
	
КонецПроцедуры  

Функция ПолучитьДомИзАдреса()
	
	МассивАдреса = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес, ",", ,Истина);
	
	КоличествоПунктов = МассивАдреса.Количество(); 
	Если КоличествоПунктов > 0 Тогда 
		ПоследнийЭлемент = МассивАдреса[КоличествоПунктов-1];
		
		Если СтрДлина(ПоследнийЭлемент) <=7 Тогда			
			НайденныйДом = ПоследнийЭлемент;			
		Иначе
			НайденныйДом = "";
		КонецЕсли;  
	КонецЕсли;    
	
	Возврат НайденныйДом
	
КонецФункции	


#Область ИнициализацияКарты
&НаСервере
Процедура ИнициализироватьКарту()
	
	//Адрес, ВидДоставки, ВариантДоставки, Филиал, Тариф, НДС
	Парам= Обработки.КартографическийИнтерфейсДоставка.ПолучитьСтруктуруПараметров();
	Парам.Вставить("Адрес", Адрес);
	Парам.Вставить("Широта", Широта);
	Парам.Вставить("Долгота", Долгота);
	Парам.Вставить("ВидДоставки", ВидДоставки);
	Парам.Вставить("ВариантДоставки", ВариантДоставки);
	Парам.Вставить("Филиал", Филиал);
	Парам.Вставить("Тариф", Тариф);
	Парам.Вставить("НДС", НДС);
	Парам.Вставить("ВидСтоимости", ВидСтоимости); 
	Парам.Вставить("БезСтоимостиФилиалов", БезСтоимостиФилиалов);

	Обработки.КартографическийИнтерфейсДоставка.ИнициализироватьКарту(КартаЯндекс, Парам);
	
	Координаты = СтрЗаменить(""+Широта,",",".") + "," + СтрЗаменить(""+Долгота,",",".");
	
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.Тариф.ТолькоПросмотр= Ложь;
	
	Если ВариантДоставки = "Выписка/АктивДо1т" Тогда
		Тариф= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
		Элементы.Тариф.ТолькоПросмотр= Истина;
	КонецЕсли;
	Элементы.Тариф.ТолькоПросмотр= Не ТарифВРучную;

	Элементы.НомерКвартиры.Доступность = Не ЧастныйДом;
	Элементы.НомерКвартиры.АвтоОтметкаНезаполненного = Не ЧастныйДом;
	
	УстановитьДоступностьДома();
	
КонецПроцедуры  

Процедура УстановитьДоступностьДома()
	
	Элементы.ГруппаАдрес.Видимость = Адрес <> "";
	ДомНеНайден = НомерДомаКарта = "";
	ДомаНетНаКарте = ДомНеНайден И НомерДома <> "";
	Элементы.ДомаНетНаКарте.Видимость = ДомНеНайден;  
	Элементы.НомерДома.Доступность = ДомНеНайден;            
	Элементы.ГруппаДомКвартира.Видимость = ДомаНетНаКарте Или НомерДома <> "";	
	Элементы.ДомаНетНаКарте.ЦветТекстаЗаголовка = ?(ДомаНетНаКарте, WebЦвета.Красный, WebЦвета.Черный);
	
КонецПроцедуры	

&НаКлиенте
Процедура ДомаНетНаКартеПриИзменении(Элемент)        
	
	Элементы.ГруппаДомКвартира.Видимость = ДомаНетНаКарте;	
	Элементы.ДомаНетНаКарте.ЦветТекстаЗаголовка = ?(ДомаНетНаКарте, WebЦвета.Красный, WebЦвета.Черный);
	
КонецПроцедуры

#Область СобытияКарты
 &НаКлиенте
Процедура КартаЯндексПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Событие = ДанныеСобытия.Event;
	Если Событие.eventData1C <> Неопределено Тогда
		
			ОбновитьДанныеСтрокиАдреса = СтрНайти(Адрес, "дом ") = 0;  
			
			ПредыдущаяШирота = Широта;
    		ПредыдущаяДолгота = Долгота;  
			ПредыдущийАдрес = Адрес;
			ОбработатьСобытиеИзСкрипта(Событие); 
			Если Широта <> ПредыдущаяШирота И Долгота <> ПредыдущаяДолгота Тогда
				
				Если ОбновитьДанныеСтрокиАдреса Тогда
					ПриИзмененииСтрокиАдреса();
				Иначе
					УстановитьВидимостьДоступность();
				КонецЕсли;  
			Иначе  
				Если ПредыдущийАдрес <> "" И Адрес <> ПредыдущийАдрес Тогда
					Адрес = ПредыдущийАдрес;       
				КонецЕсли;    
				
				Если ПредыдущийАдрес = "" И Адрес <> "" Тогда
					ПриИзмененииСтрокиАдреса();
				КонецЕсли;
			КонецЕсли;    
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция  ОбработатьСобытиеИзСкрипта(Событие)
    
	evt = Событие.eventData1C.event;
    params = Событие.eventData1C.params;
    
	Если evt = "showMessage" Тогда
		Сообщить(params);
        
    ИначеЕсли evt = "addPlacemark" Тогда
        Адрес = params.address;
    	Широта = params.lat;
    	Долгота = params.lon;
        Координаты = "" + Широта + "," + Долгота;
        
    ИначеЕсли evt = "jsError" Тогда
        
        НомерСтроки = params.line + 1;
        ТекстОшибки = params.message;
        
        _КЯ = КартаЯндекс;
        _КЯ = СтрЗаменить(_КЯ, "&", "&amp;");
        _КЯ = СтрЗаменить(_КЯ, """", "&quot;");
        _КЯ = СтрЗаменить(_КЯ, "<", "&lt;");
        _КЯ = СтрЗаменить(_КЯ, ">", "&gt;");

        Строки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(_КЯ, Символы.ПС, , );
        ТекстHTML = "";
        Для н = 0 По Строки.Количество()-1 Цикл
            ТекстHTML = ТекстHTML + "<li" + ?(н = НомерСтроки," id='err'","") + ">" + Строки[н] + "</li>";
        КонецЦикла;
        
        ТекстHTML = "<!DOCTYPE html>
        |<html>
        |<head>
        |<meta charset='utf-8'>
        |<style>
        |  body {font-family: Arial,Helvetica,sans-serif; font-size:12px;}
        |  #err { background: red; }
        |</style>
        |<script>
        |  const err_line = {{err_line}};
        |  function setFocusToId(id){
        |    const el = document.getElementById(id);
        |    el.focus();
        |    el.scrollIntoView();
        |  }     
        |</script>
        |</head>
        |<body>
        |<ol>" + ТекстHTML + "</ol>
        |<script>
        |setTimeout(()=>{setFocusToId('err')},5);
        |</script>
        |</body>
        |</html>";
        
        ТекстHTML = СтрЗаменить( ТекстHTML, "{{err_line}}", НомерСтроки);
        ОтладкаHTML = ТекстHTML;

        Элементы.СтраницаОшибка.Видимость = Истина;
    КонецЕсли;                                                 
    
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ПередатьВДокумент(Команда)
	
	Если ИзмененыПараметрыРазгрузки Тогда
		Сообщить("Изменены параметры доставки, которые влияют на стоимость услуги разгрузки, необходимо перезаполнить параметры разгрузки!");
		Возврат;
	КонецЕсли;
	
	КартаДокумент = Элементы.КартаЯндекс.Документ;
	ПеременныеКарты = КартаДокумент.defaultView.mapData;
	
	ДанныеКарты = Новый Структура;
	ДанныеКарты.Вставить("Тариф", Тариф);
	
	ДанныеКарты.Вставить("ВидДоставки", ВидДоставки);
	ДанныеКарты.Вставить("РасчетПоРасстоянию", ПеременныеКарты.distanceCalc);
	ДанныеКарты.Вставить("СтоимостьПоРасстоянию", ПеременныеКарты.distanseCost);
	ДанныеКарты.Вставить("НДС", НДС);
	ДанныеКарты.Вставить("СтоимостьДоставки", ПеременныеКарты.price); 
	ДанныеКарты.Вставить("Зона", ПеременныеКарты.zone);
		
    ДанныеКарты.Вставить("Адрес", Адрес);	
	ДанныеКарты.Вставить("Широта", Широта);
	ДанныеКарты.Вставить("Долгота", Долгота);

	ДанныеКарты.Вставить("ТарифВРучную", ТарифВРучную);
	
	//Разгрузка
	ДанныеКарты.Вставить("Этаж", Этаж);
	ДанныеКарты.Вставить("ВариантРазгрузки", ВариантРазгрузки);
	ДанныеКарты.Вставить("СтоимостьРазгрузкиДляКлиента", СтоимостьРазгрузкиДляКлиента);
	ДанныеКарты.Вставить("СтоимостьРазгрузкиДляВодителя", СтоимостьРазгрузкиДляВодителя);
	ДанныеКарты.Вставить("НаличиеПандуса", НаличиеПандуса);   
	ДанныеКарты.Вставить("РучнаяКорректировкаВариантовРазгрузки", РучнаяКорректировкаВариантовРазгрузки);
	ДанныеКарты.Вставить("ВариантыРазгрузкиВРучнуюАдресВХранилище", ВариантыРазгрузкиВРучнуюАдресВХранилище);
	
	Если Этаж > 0 И ЗначениеЗаполнено(ВариантРазгрузки) Тогда
		ДанныеКарты.Вставить("ДоставкаСРазгрузкой", Истина);
	Иначе
		ДанныеКарты.Вставить("ДоставкаСРазгрузкой", Ложь);
	КонецЕсли;

	//детали адреса
	ДетальныеДанныеАдресаЗаполнены = (НомерДома <> "") И ?(ЧастныйДом, Истина, ЗначениеЗаполнено(НомерКвартиры) ИЛИ ЗначениеЗаполнено(НомерОфиса));
	Если Не ДетальныеДанныеАдресаЗаполнены Тогда
		Предупреждение("Не заполнены обязательные поля адреса!");
		Возврат;
	Иначе
		ДанныеКарты.Вставить("НомерДома", НомерДома);
		ДанныеКарты.Вставить("НомерКвартиры", НомерКвартиры);
		ДанныеКарты.Вставить("ЭтоЧастныйДом", ЧастныйДом);
		ДанныеКарты.Вставить("НомерКорпуса", НомерКорпуса);
		ДанныеКарты.Вставить("НомерОфиса", НомерОфиса);
		ДанныеКарты.Вставить("ДополнениеКАдресу", ДополнениеКАдресу); 
		ДанныеКарты.Вставить("ДомаНетНаКарте", ДомаНетНаКарте);
	КонецЕсли;
	
	Закрыть(ДанныеКарты);

КонецПроцедуры

&НаКлиенте
Процедура ВРучнуюПриИзменении(Элемент)
	Элементы.Тариф.ТолькоПросмотр= Не ТарифВРучную;
КонецПроцедуры

&НаКлиенте
Процедура КартаЯндексДокументСформирован(Элемент)
    
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРазгрузки(Команда)
	
	КартаДокумент = Элементы.КартаЯндекс.Документ;	
	ПеременныеКарты = КартаДокумент.defaultView.mapData;
	ЗаполнитьПараметрыРазгрузки(ПеременныеКарты.zone);	
	
	ОткрытьФорму("Обработка.КартографическийИнтерфейсДоставка.Форма.НастройкаПараметровРазгрузки", Новый Структура("ПараметрыРазгрузкиАдресВХранилище", ПараметрыРазгрузкиАдресВХранилище), ЭтаФорма, Истина,,, Новый ОписаниеОповещения("ЗакрытиеФормыНастройкиПараметровЗагрузки", ЭтотОбъект));
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыРазгрузки(Зона)
	
	ЗонаДоставки = Обработки.КартографическийИнтерфейсДоставка.ПолучитьЗонуДоставкиПоНаименованию(Зона);

	Если ЗначениеЗаполнено(ПараметрыРазгрузкиАдресВХранилище) Тогда
		ПараметрыРазгрузки = ПолучитьИзВременногоХранилища(ПараметрыРазгрузкиАдресВХранилище);
	Иначе
		ПараметрыРазгрузки = УправлениеЛогистикойСервер.ПолучитьСтруктуруПараметровРазгрузки();
	КонецЕсли;

	Если ЗначениеЗаполнено(ЗонаДоставки) Тогда
		ПараметрыРазгрузки.Зона = УправлениеЛогистикойСервер.ПолучитьГлобальнуюЗону(ЗонаДоставки,Филиал);
	КонецЕсли;

	Если НДС = "СНДС" Тогда
		 ПараметрыРазгрузки.СНДС = Истина;
	 Иначе
		 ПараметрыРазгрузки.СНДС = Ложь;
	КонецЕсли;

	Если НомерКвартиры > 0 Тогда
		ПараметрыРазгрузки.НомерКвартиры = НомерКвартиры;
	КонецЕсли;       

	ПараметрыРазгрузки.Вставить("ЧастныйДом", ЧастныйДом);  

	Если ЗначениеЗаполнено(ПараметрыРазгрузкиАдресВХранилище) Тогда
		ПараметрыРазгрузкиАдресВХранилище = ПоместитьВоВременноеХранилище(ПараметрыРазгрузки,ПараметрыРазгрузкиАдресВХранилище);
	Иначе
		ПараметрыРазгрузкиАдресВХранилище = ПоместитьВоВременноеХранилище(ПараметрыРазгрузки,ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;

	ИзмененыПараметрыРазгрузки = Ложь;

КонецПроцедуры

Процедура ОчиститьПараметрыРазгрузки()
	
	Если Этаж > 0 Тогда
	Этаж = 0;
	НомерКвартиры = 0;
	ВариантРазгрузки = "";
	ИзмененыПараметрыРазгрузки = Истина;
	Сообщить("Изменены параметры доставки, которые влияют на стоимость услуги разгрузки, необходимо перезаполнить параметры разгрузки!");
конецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыНастройкиПараметровЗагрузки(Результат,Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчетРазгрузкиДействует(ДатаДокумента)
	Возврат УправлениеЛогистикойСервер.РасчетРазгрузкиДействуетНаДату(ДатаДокумента);
КонецФункции

&НаКлиенте
Процедура СохранитьОбъектДоставки(Команда)
	ФормаСправочника = ПолучитьФорму("Справочник.ОбъектыДоставки.Форма.ФормаЭлемента");
	ФормаСправочника.Объект.Владелец = Партнер;  
	ФормаСправочника.Объект.Адрес = Адрес;
	ФормаСправочника.Объект.Широта = Широта;
	ФормаСправочника.Объект.Долгота = Долгота; 
	ФормаСправочника.Объект.ЗонаДоставкиДляВодителя = ПолучитьЗонуДоставки(Элементы.КартаЯндекс.Документ.defaultView.mapData.zone);
    ФормаСправочника.Открыть();
КонецПроцедуры  

&НаСервере
Функция ПолучитьЗонуДоставки(Зона)
	Возврат Справочники.ЗоныДоставкиДоКлиента.НайтиПоНаименованию(Зона);
КонецФункции


#КонецОбласти
